//Напишите программу, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N.n
Console.WriteLine("Вводим число N: ");
int N = int.Parse(Console.ReadLine()!);
int i = 1;
while (i<N-2)
{
    i % 2 == 1;
    Console.WriteLine(i);
    i++;
}

//тут я не справился((